---
type: AdvancedTransparent
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 10
tags: [revit-api, class]
---

# AdvancedTransparent

`Autodesk.Revit.DB.Visual.AdvancedTransparent` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | SurfaceAlbedo | 2018.1 | `public static string SurfaceAlbedo { get ; }` |
| Property | SurfaceAnisotropy | 2018.1 | `public static string SurfaceAnisotropy { get ; }` |
| Property | SurfaceCutout | 2018.1 | `public static string SurfaceCutout { get ; }` |
| Property | SurfaceNdfType | 2018.1 | `public static string SurfaceNdfType { get ; }` |
| Property | SurfaceNormal | 2018.1 | `public static string SurfaceNormal { get ; }` |
| Property | SurfaceRotation | 2018.1 | `public static string SurfaceRotation { get ; }` |
| Property | SurfaceRoughness | 2018.1 | `public static string SurfaceRoughness { get ; }` |
| Property | TransparentColor | 2018.1 | `public static string TransparentColor { get ; }` |
| Property | TransparentDistance | 2018.1 | `public static string TransparentDistance { get ; }` |
| Property | TransparentIor | 2018.1 | `public static string TransparentIor { get ; }` |